[
  {
    "ID": 1,
    "Name": "The Journey Begins",
    "PriceToUnlock": 0,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "In the depths of the ancient dungeon, you tread cautiously your footsteps echoing ominously off the damp stone walls.- it is not like you are going to run head first into danger, you tried that last time and all you got was the princess complaining that she was saved too quickly and no one had time to miss her.",
    "DeathMessage": "N/A"
  },
  {
    "ID": 2,
    "Name": "Bright Light of Doom",
    "PriceToUnlock": 50,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "Your heart races as you grip your Iron Sword, ready for whatever lurks in the shadows. However, you seem to notice a bright light emanating in the distance. However, through your numerous watchings of Lord Of the Rings you know that this is not a good thing, and even worse you are clean shaven so no one can grab your beard to save you.",
    "DeathMessage": "N/A"
  },
  {
    "ID": 3,
    "Name": "Skeleton Slayer",
    "PriceToUnlock": 100,
    "ConditionToNotDie": "Sword",
    "StoryUnlock": "A skeleton appears and you instinctively swing your sword, shattering the skull of the skeleton. Its bony remains clatter to the ground as a sense of victory washes over you - premature, but you have to enjoy the easy wins.",
    "DeathMessage": "A skeleton appears and instinctively you swing your arm at it. However, you have no sword—probably should've bought one of those—and the skeleton makes quick work of you. At least you tried."
  },
  {
    "ID": 4,
    "Name": "Heartbreak Trap",
    "PriceToUnlock": 150,
    "ConditionToNotDie": "Armor",
    "StoryUnlock": "The further you venture into the dungeon, the colder and darker it becomes, causing you to trigger a trap which shoots a bolt right at your heart. As much as it is broken ever since your wife left, you are quite partial for it to remain unscathed.",
    "DeathMessage": "The further you venture into the dungeon, the colder and darker it becomes, causing you to trigger a trap which shoots a bolt right at your heart. Not only is your heart emotionally broken from when your wife left you, it is now physically broken as well. Maybe if you had some armor to protect you..."
  },
  {
    "ID": 5,
    "Name": "Troll Union",
    "PriceToUnlock": 200,
    "ConditionToNotDie": "Donated 200",
    "StoryUnlock": "As you approach a large stone door, the troll guarding asks, 'Please donate some Gold to the Troll Union to help cover our lawyer costs - we are trying to sue the Dragon for unpaid wages.' Thanking your lucky stars that you already have donated money to the Troll Union, you proudly present your badge and the Troll swings the door open with a creak, allowing you to stride through while feeling like a hero who has just been given the VIP treatment.",
    "DeathMessage": "As you approach a large stone door, the troll guarding asks, 'Please donate some Gold to the Troll Union to help cover our lawyer costs - we are trying to sue the Dragon for unpaid wages.' You politely inform him that you have donated *some* money; however, he deems it not enough since you have not got the 200 badge. Seems more like a bribe than a donation; however, you do not get to raise this with him since he has pummeled you to death. Serves you right for being tight."
  },
  {
    "ID": 6,
    "Name": "If it ain't stupid",
    "PriceToUnlock": 250,
    "ConditionToNotDie": "Mage's Staff",
    "StoryUnlock": "As you walk deeper into the dungeon, your foot catches on a hidden rune - you are very good at triggering traps, however it may not be a good skill to have. A bolt of arcane magic shoots toward you. Thankfully, you’re armed with your Mage’s Staff, but you missed the lesson on creating magic shields. So, you throw the staff at the bolt instead. It shatters into pieces. If it looks stupid but it works, it ain't stupid.",
    "DeathMessage": "As you walk deeper into the dungeon, your foot catches on a hidden rune - you are very good at triggering traps; however, it may not be a good skill to have. A bolt of arcane magic shoots toward you. Unfortunately for you, the day that shield spells were taught at school you were bunking off. Your last thoughts before you die is wishing you had something to intercept the bolt like a staff..."
  },
  {
    "ID": 7,
    "Name": "Is it a donation or a bribe?",
    "PriceToUnlock": 300,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "As you navigate through narrow passageways, you stumble upon a hidden alcove filled with Trolls animatedly discussing how they plan to sue the Dragon for unpaid wages. You hope to sneak by unnoticed, but to no avail. They catch you. As they approach, they notice your Troll Union Badge and let you pass unharmed. The donation is feeling more like a bribe by the second. However, can you really put a price on your life? You can—it's 200 Gold, but luckily, you already donated.",
    "DeathMessage": "N/A"
  },
  {
    "ID": 8,
    "Name": "Crossbow Courage",
    "PriceToUnlock": 350,
    "ConditionToNotDie": "Crossbow of Precision",
    "StoryUnlock": "As you enter a dimly lit chamber, you hear the faint sound of bones rattling. Yay more skeletons you think to yourself. Instinctively, you reach for your crossbow and load a normal bolt *wink wink nudge nudge maybe you might need fire ones later*. From the shadows, a horde of undead stumbles toward you. Without hesitation, you take aim and fire. One by one, the zombieskeletons collapse. You were always good at crossbow practice at school.",
    "DeathMessage": "As you enter a dimly lit chamber, you hear the faint sound of bones rattling. Yay more undead beings you think to yourself. Instinctively, you reach for your crossbow and remember you lost it in a game of Poker a few days ago. You should've really bought a replacement. While you are realizing the error of your ways, you are beaten to death by the hordes of undead."
  },
  {
    "ID": 9,
    "Name": "Helping Yourself",
    "PriceToUnlock": 400,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "Remembering how the Dragon does not pay his workers, you quickly gather some treasure, telling yourself that you will give it to the Trolls on your way out to make up for lost wages. It's an outright lie, but it makes you feel better. You are 100% going to keep all the money for yourself.",
    "DeathMessage": "N/A"
  },
  {
    "ID": 10,
    "Name": "Poker Night",
    "PriceToUnlock": 450,
    "ConditionToNotDie": "Gamble at least -100",
    "StoryUnlock": "With your arms full of gold, you stumble across several Trolls playing cards. Noticing your shiny Union Badge, they ask you to play. You can’t really say no to a Troll, so against your better judgment, you sit at the table. Luckily, gambling comes as second nature to you and you clear out the Trolls pretty quickly before going on your way.",
    "DeathMessage": "With your arms full of gold, you stumble across several Trolls playing cards. Noticing your shiny Union Badge, they ask you to play. You cannot really say no to a Troll, so against your better judgment, you sit at the table. However, you have not really gambled that much in your life so do not really get the game or the rules. The Trolls quickly get frustrated at your lack of skills and realize it's more fun to eat you. If only you had spent more time gambling..."
  },
  {
    "ID": 11,
    "Name": "Portal Inquiry",
    "PriceToUnlock": 500,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "Having walked for what seems like hours, you come across a set of Trolls guarding what looks like a magic portal. Quickly polishing your Union Badge, you approach them and ask, 'How far till I reach the dragon chamber?' The uglier one of the pair pipes up, 'You are about halfway, mate, and thanks for your donation. We appreciate it.' You remind yourself, if you ever kidnap a princess and have a lair, to pay your guards.",
    "DeathMessage": "N/A"
  },
  {
    "ID": 12,
    "Name": "Another Donation???",
    "PriceToUnlock": 550,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "You cautiously make your way through the portal and find yourself in a glimmering treasure chamber. Gold coins cover the floor, and gems sparkle in the dim light. You take a moment to breathe it all in, but as you do, a Troll emerges from behind a mound of treasure and growls, 'Welcome, traveler! For access to this treasure, please donate to the Troll Union.' You have to roll your eyes at their persistence. However, you think you might just give them something in exchange for a few shiny things.",
    "DeathMessage": "You cautiously make your way through the portal and find yourself in a glimmering treasure chamber. Gold coins cover the floor, and gems sparkle in the dim light. You take a moment to breathe it all in, but as you do, a Troll emerges from behind a mound of treasure and growls, 'Welcome, traveler! For access to this treasure, please donate to the Troll Union.' You shake your head, refusing to part with your wealth. Unfortunately, Trolls are not known for their patience, and you quickly find yourself overwhelmed as they rush to take what is 'theirs'—which includes you."
  },
  {
    "ID": 13,
    "Name": "Dragon Scent",
    "PriceToUnlock": 600,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "As you survey the treasure chamber, you begin to feel a strange warmth in the air. It's subtle at first, but soon it intensifies. You can't shake the feeling that something is watching you. A quick glance over your shoulder confirms it: a faint glow emanates from a dark corner of the room. You grab your things and head toward the glow. A dragon could be lurking behind there, and it is only a matter of time before you face it.",
    "DeathMessage": "As you survey the treasure chamber, you begin to feel a strange warmth in the air. It's subtle at first, but soon it intensifies. You can't shake the feeling that something is watching you. A quick glance over your shoulder confirms it: a faint glow emanates from a dark corner of the room. However, you feel a little too confident in your abilities, and ignoring the increasing heat you continue to survey the chamber, only to realize too late that it was the dragon's breath. You were quite literally consumed by flames—perhaps it was time to reconsider your choices."
  },
  {
    "ID": 14,
    "Name": "Flame of Doom",
    "PriceToUnlock": 650,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "Stepping cautiously around the treasure piles, you finally uncover a dragon egg nestled in the shadows. You think about what it means to find a dragon egg but quickly dismiss it because you want your name to go down in history for a different reason. As you look at the glimmering gold surrounding you, you can't help but imagine the riches you’ll have once you defeat the dragon. However, that dream quickly fades as the egg emits a low growl, and the warmth intensifies. You know you are in the presence of something very dangerous.",
    "DeathMessage": "Stepping cautiously around the treasure piles, you finally uncover a dragon egg nestled in the shadows. You think about what it means to find a dragon egg but quickly dismiss it because you want your name to go down in history for a different reason. As you look at the glimmering gold surrounding you, you can't help but imagine the riches you’ll have once you defeat the dragon. That is until the egg hatches and a young dragon emerges, curious but hungry. It does not care that you have dreams of glory; you are nothing more than a snack in its eyes."
  },
  {
    "ID": 15,
    "Name": "Final Confrontation",
    "PriceToUnlock": 700,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "In the heart of the chamber, you finally spot the Dragon. Its massive form stretches across the cavern, scales glimmering in hues of crimson and gold. As it awakens and locks its fierce eyes on you, adrenaline courses through your veins. You’ve come too far to turn back now. You draw your sword, preparing for the fight of your life.",
    "DeathMessage": "In the heart of the chamber, you finally spot the Dragon. Its massive form stretches across the cavern, scales glimmering in hues of crimson and gold. You realize too late that you’ve come unprepared for this encounter. Without proper armor or a sturdy weapon, your bravado quickly wanes as the dragon breathes fire upon you, leaving you no chance to fight back. Your last moments are filled with regret as you realize you should have taken the time to gather the right gear."
  },
  {
    "ID": 16,
    "Name": "Fortune Favors the Bold",
    "PriceToUnlock": 750,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "With your heart pounding in your chest, you take a deep breath and charge at the Dragon. Fortune favors the bold, or so they say. You leap into the air, sword raised high, prepared to make your mark on history.",
    "DeathMessage": "With your heart pounding in your chest, you take a deep breath and charge at the Dragon. Unfortunately, fortune does not favor the unprepared, and as you leap into the air, the Dragon effortlessly swats you away with its tail. You crash into the ground, your dreams of glory fading into nothingness."
  },
  {
    "ID": 17,
    "Name": "Treasure Hunter",
    "PriceToUnlock": 800,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "After successfully defeating the Dragon, you turn your sights to the treasure pile. You find yourself digging through gold coins and gems, feeling like a true treasure hunter. It’s hard not to smile as you think about all the riches you’ll bring home.",
    "DeathMessage": "After successfully defeating the Dragon, you turn your sights to the treasure pile. However, in your haste to grab the gold, you accidentally trigger a hidden trap, causing a cascade of heavy boulders to fall upon you. You were so close to victory, only to be crushed by your own greed."
  },
  {
    "ID": 18,
    "Name": "Legacy of a Hero",
    "PriceToUnlock": 900,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "As you step back from the treasure pile, you envision your legacy as a hero. The bards will sing of your adventures, and the townspeople will revere you. You realize that this is the moment you were meant for.",
    "DeathMessage": "As you step back from the treasure pile, you envision your legacy as a hero. However, in your moment of distraction, a greedy Goblin sneaks up behind you and steals your sword, leaving you defenseless. You turn to confront the Goblin, but it stabs you in the back, ending your heroic dreams."
  },
  {
    "ID": 19,
    "Name": "A Hero’s Downfall",
    "PriceToUnlock": 1000,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "As you prepare to leave the dungeon, a shadow looms over you. The dragon has returned, seeking revenge for your earlier victory. Your heart sinks as you realize that you may not escape this time.",
    "DeathMessage": "As you prepare to leave the dungeon, a shadow looms over you. The dragon has returned, seeking revenge for your earlier victory. You attempt to flee, but it's too late; the dragon unleashes a torrent of flames, consuming you in a fiery blaze. Your adventure ends in tragedy."
  },
  {
    "ID": 20,
    "Name": "The End of an Era",
    "PriceToUnlock": 1200,
    "ConditionToNotDie": "N/A",
    "StoryUnlock": "As you exit the dungeon, you feel a sense of accomplishment. The legends of your adventures will live on. You’ve faced countless dangers and emerged victorious, but you can't shake the feeling that this might not be the end after all.",
    "DeathMessage": "As you exit the dungeon, you feel a sense of accomplishment. However, your moment of triumph is cut short as a massive boulder, dislodged from the ceiling, crushes you. You realize too late that your journey may have ended, but the tales of your adventures will live on—if only in tragedy."
  }
]
